{
  "status": "success",
  "totalResults": 432,
  "results": [
    {
      "title": "A totaled Tesla was sold for parts in the US but came back online in the Ukraine — here’s what happened",
      "link": "https://www.cnbc.com/2023/08/10/how-totaled-tesla-sold-for-parts-in-us-came-back-online-in-ukraine.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "The car or its computer was suddenly online in a Southern region of war-torn Ukraine.",
      "content": "In this article TSLA Follow your favorite stocks CREATE FREE ACCOUNT The Tesla Motors Inc. Model X sport utility vehicle (SUV). David Paul Morris | Bloomberg | Getty Images A Tesla Model X totaled in the U.S. late last year suddenly came back online and started sending notifications to the phone of its former owner, CNBC executive editor Jay Yarow, months later. The car or its computer was suddenly online in a Southern region of war-torn Ukraine , he found by opening up his Tesla app and using a geolocation feature. The new owners in Ukraine were tapping into his still-connected Spotify app to listen to Drake radio playlists, he also discovered. When Yarow posted about this to the social network X, formerly known as Twitter, his post went viral, and followers wanted to know why this this happening and whether it was a security risk. According to the CTO of automotive security firm Canis Labs, Ken Tindell, there can indeed be a security risk with totaled cars that are restored. He explained in an e-mail to CNBC, \"The credentials to internet services are clearly left in the vehicle electronics and then can be used by whoever gets hold of the electronics.\" He added, \"In general it's possible to get data out of working electronics — it's merely a question of how much effort that takes.\" This is far from a Tesla-specific issue, he said. Cars, like laptops, smartphones, and even refrigerators and TVs, are now internet-connected devices that can store personal data. \"I think it needs to be more widely understood by dealers and owners that there is this issue of private data within the vehicle,\" Tindell said. Overseas demand for totaled Teslas How did the vehicle end up in Ukraine? CNBC found that after the car was totaled, online auction site Copart listed it for sale, according to website listings. The company, which currently has more than 1,600 Tesla vehicles listed for sale, is connected to salvage yards across the U.S., including one in New Jersey where the car ended up. Copart specializes in damaged or totaled vehicles that have what's called a \"salvage title,\" issued when an insurance company declares it a total loss, warning future buyers that there was a significant problem. Copart sells more than 2 million vehicles a year, with operations in 11 countries, according to the company's website. Such vehicles cannot legally drive on U.S. roadways, but some countries aren't as stringent. \"Cars go to the repair shop or junk yard then find their way to a second market and then are suddenly being shipped overseas,\" said Mike Dunne, a former General Motors international executive who now serves as CEO of auto consulting firm ZoZoGo. The practice has been going on for decades and accelerated with the rise of digital auctions, according to Steven Lang, an auctioneer and founder of used car marketplace 48 Hours And A Used Car . \"Starting in the Y2K era, the digital auction site took over. So now you can have someone in Ukraine bidding on it. And then someone else from Norway bidding on it … and you haven't even touched an American border or an American bidder,\" said Lang, who has been in the vehicle auction business for more than 24 years. \"Virtually all of the vehicles that are totaled will end up at a salvage auction,\" he said. One online auction website that specializes in such sales estimated the winning bid for the vehicle would be between $27,400 and $29,400. A final sale price was not immediately known. Neither the salvage yard nor Copart immediately responded for comment about the vehicle and who bought it. What owners can do after the fact Tesla support staff told Yarow he should disconnect his car from his account, offering the following instructions via email: 1. Open the Tesla app Tap profile icon in top-right corner 2. Tap 'Add/Remove Products' > 'Remove' > 'Vehicle' 3. Select the VIN, then tap 'Get Started' 4. Enter the vehicle and sale details, then tap 'Next' 5. Enter the new owner information, then tap 'Next' 6. Enter security code from e-mail, then tap 'Confirm' 7.Submit the request by clicking on 'Remove Vehicle' Reminder: If it asks if you sold the vehicle say yes.\" Tesla didn't tell him how he was supposed to obtain the new owner information as he hadn't sold the car. According to Canis Labs CTO Ken Tindell, disconnecting one's account from a totaled vehicle can help stop others from using apps that had been connected, such as Spotify in Yarow's case. However, data could still be extracted from the totaled vehicle's electronics. \"What would the trip history and phone book of a celebrity be worth to a blackmailer or a kidnapper?\" Tintell asked. He and other security experts compared the situation having an Apple laptop stolen. In some cases, Apple can wipe the laptop or device clean remotely when it comes online. But \"a malign repair shop can take out the hard drive and copy all the data off it before scrapping a broken laptop.\" This is why Apple routinely encrypts its hard drives, the CTO noted. \"It's the only way to prevent the data being stolen by someone with physical access to an offline device.\" An automotive cybersecurity veteran and the founder of RightHook, Warren Ahner, said that ideally a company like Tesla would \"Have a portal where a user can sign in with online credentials and say 'remove all my info, then disconnect my vehicle from the account,' and would be able issue a remote-wipe command to the car when it comes online, deleting it all including GPS, saved locations and the rest.\" However, he said, owners can be their own \"personal risk police,\" and avoid giving their vehicles or rental cars that they use lots of personal info. \"Always purge your data after you are done with the vehicle and try not to share more info with the car than you absolutely need to share,\" Ahner recommended. \"If I pair my phone with the car I'm renting or owning I don't allow it to synch location and contacts. I only give it Bluetooth access to talk over the top of my music and so I can us whatever music streaming app I like.\" An automotive white hat hacker who uses the handle Green the Only has been sounding the alarm about data on cars for years . \"All the phone directory and calendar stuff might be valuable,\" he said. Once a car or car computer has changed possession is back online, he says that the previous owners \"can't do much.\" One problem is that an old owner can \"accrue charges for Supercharging,\" and other items Tesla -- or other vehicle makers -- may sell on a subscription or pay-per-charge basis. They can always submit a request to Tesla to remove the car from their account, but that's it. Green the Only agreed with Tindell and Ahner -- Tesla \"probably can add a 'remote wipe and then remove from my account' in addition to the 'remove from my account' option they have now. They probably should have added that long ago.\"",
      "pubDate": "2023-08-10 22:19:04",
      "image_url": null,
      "source_id": "cnbc",
      "category": ["technology"],
      "country": ["australia"],
      "language": "english"
    },
    {
      "title": "U.S. sticking with Kyiv even with the slow pace of Ukraine's counteroffensive",
      "link": "https://www.washingtontimes.com/news/2023/aug/10/us-sticking-kyiv-even-slow-pace-ukraines-counterof/?utm_source=RSS_Feed&utm_medium=RSS",
      "keywords": null,
      "creator": ["Mike Glenn"],
      "video_url": null,
      "description": "Top Pentagon officials are acknowledging that the pace of Ukraine's long-awaited counteroffensive isn't moving as swiftly as some analysts had anticipated following Kyiv's early successes against Russian occupiers.",
      "content": "Back Print By Mike Glenn - The Washington Times - Thursday, August 10, 2023 Top Pentagon officials are acknowledging that the pace of Ukraine’s long-awaited counteroffensive isn’t moving as swiftly as some analysts had anticipated following Kyiv’s early successes against Russian occupiers. Armed with top-of-the-line armored personnel carriers from U.S. and other NATO countries, the Western-trained Ukrainian troops have become bogged down in miles of densely-packed minefields and tank traps. Meanwhile, they have come under around-the-clock Russian artillery barrages and helicopter attacks while attempting to maneuver their way through the obstacles. Ukrainian commanders are now focusing on battering down the Russian front-line forces with their own artillery and long-range missiles rather than employing the kind of sweeping, coordinated — and complicated — battlefield maneuvers that U.S. combat leaders favor. Air Force Brig. Gen. Pat Ryder, a Defense Department spokesman, noted that the Russian minefields and other obstacles have presented Kyiv with a “less than ideal situation” amid heavy fighting in Ukraine’s south and east. But, “when it comes to the Ukrainians and the fight they are conducting right now, I’m not going to stand here at this podium and second-guess a frontline commander,” he said.“They are in a tough fight. They have known from the beginning, regardless of when the counter-offensive started, that it was going to be a tough fight.” The U.S. and its allies have been providing sophisticated combined arms and maneuver training to Ukraine at several locations in NATO countries, including the U.S. Army Europe’s 7th Army Training Command in Grafenwohr, Germany. The Biden administration on Thursday formally asked Congress for more than $13 billion in emergency defense aid to Ukraine and an additional $8 billion for humanitarian support through the end of the year, the Associated Press reported. The request is likely to face a tougher scrutiny from war-skeptical congressional Republicans than was the case with previous requests. Secretary of the Army Christine Wormuth said she’s not surprised that learning a new way to fight a war in such a short time has proven to be challenging for the Ukrainians. “It’s complicated. Our soldiers have had years to practice this. The Ukrainians have had several weeks,” she said Thursday while speaking to a small number of reporters at the Pentagon. “This is a very different approach from what they’re used to.” She compared NATO’s mission to train Ukrainian soldiers to how U.S. forces worked with Iraqi military troops during the campaign to eradicate ISIS terrorists. “It was slow going with the Iraqis. They did not have the offensive mindset that our army is used to,” Ms. Wormuth said. “We worked with the Iraqi army for years. I don’t find it entirely surprising.” Secretary of Defense Lloyd Austin has often observed that Ukraine’s fight against Russia was going to be a “marathon rather than a sprint.” “The Ukrainians, against all odds, were able to push the Russians back into a defensive position,” Gen. Ryder said. “We’re going to consult with them [and] we’re going to provide them with training so they can take back sovereign territory and ultimately win this fight.” • Mike Glenn can be reached at mglenn@washingtontimes.com . Copyright © 2023 The Washington Times, LLC. Click here for reprint permission . Please read our comment policy before commenting. Click to Read More and View Comments Click to Hide",
      "pubDate": "2023-08-10 22:15:35",
      "image_url": "https://twt-thumbs.washtimes.com/media/image/2023/08/10/Russia_Ukraine_War_76704--425ec_s1440x960.jpg?f72536d07237fdd262042ae8f5e6e6de3b865f3c",
      "source_id": "washingtontimes",
      "category": ["top"],
      "country": ["united states of america"],
      "language": "english"
    },
    {
      "title": "Alarm grows as Ukraine’s counteroffensive falters",
      "link": "https://thehill.com/policy/defense/4148128-alarm-grows-as-ukraines-counteroffensive-falters/",
      "keywords": ["Defense", "International", "Policy", "Russia-Ukraine war"],
      "creator": ["Brad Dress"],
      "video_url": null,
      "description": "There is growing alarm about the pace and prospects of Ukraine’s counteroffensive, with few signs of progress in recent weeks and Russian lines holding strong. Those concerns picked up steam in the past week after Ukraine launched a second push in the southern Zaporizhzhia region and has still come up mostly empty in the eyes...",
      "content": "There is growing alarm about the pace and prospects of Ukraine’s counteroffensive, with few signs of progress in recent weeks and Russian lines holding strong. Those concerns picked up steam in the past week after Ukraine launched a second push in the southern Zaporizhzhia region and has still come up mostly empty in the eyes of Western allies. U.S. officials on Tuesday that significant progress was “highly unlikely,” especially with fall and winter fast approaching. And another U.S. official told NBC News, “There is a frustration that they have not used more of the combat power that they have.” The Quincy Institute for Responsible Statecraft said in a “Time” magazine piece that Ukrainian forces are outmanned and outgunned and need a “Plan B,” which would include scaling back to focus on defense. Sen. Tommy Tuberville (R-Ala.), a former football coach, gave voice to the growing skepticism, comparing Ukraine to “a junior high team playing a college team” in an interview with Fox News this week, adding: “They can’t win.” Despite the sobering assessments U.S. officials are making anonymously in the media, the Biden administration maintains that Ukraine will recapture Russian-occupied territory and ultimately triumph. The narrative has frustrated Ukraine, which continues to urge patience as it chips away at Russian fortifications — including thousands of landmines — and searches for weak spots along the frontlines. Maksym Skrypchenko, the president of the Kyiv-based Transatlantic Dialogue Center, a nonprofit think tank that advises Ukraine’s government, said the current Western support is “enough to survive” but “not enough to effectively counterattack.” “Without [the weapons] I think that nobody should expect some miracle like it was a year ago, because Russia is more prepared right now and already knows what to expect from the Ukrainian side,” he said. Ahead of the offensive, which launched in early June, NATO members gave Ukraine hundreds of modern tanks, armored carriers and infantry fighting vehicles. The U.S. said Kyiv had everything it needed for the offensive. Some allies have also delivered Soviet-era jets and long-range missiles to supplement Ukraine’s needs. But Skrypchenko noted the U.S. has held back on key weapon systems such as Army Tactical Missile System (ATACMS), which fires long-range missiles, and F-16 fighter jets. He also said Ukraine does not have nearly enough artillery shells because defense production in Western nations has been unable to keep pace with the war. Skyrpchenko said Soviet-era jets are unable to cross into the front lines to execute certain maneuvers because they will be “shut down,” and the highly valued ATACMS would significantly boost the military’s ability to destroy key Russian-held bridges. “Of course it’s not a silver bullet, but it would be dramatically easier for Ukraine to advance using better and more advanced weapons,” he argued. The counteroffensive in Zaporizhzhia has big ambitions: Ukrainian forces need to break through miles of territory to the Sea of Azov and sever a land bridge from mainland Russia to the Crimean Peninsula. Further north in eastern Ukraine, troops are trying to retake territory around the city of Bakhmut in a push to liberate the Donetsk region. Both offensives face major obstacles of dug-in trenches, minefields, Russian air superiority and intense artillery defenses. And Russian troops are resisting Ukraine with its advances, with territory constantly being traded back and forth. Branislav Slantchev, a professor of political science at the University of California, San Diego, who studies the conduct of war, said Ukraine was moving slower than some supporters would expect because Kyiv wants to minimize casualties. Slantchev predicted Ukraine is “very close to a breakthrough in Zaporizhzhia,” pointing out it took Ukraine months of work before big results were achieved in a successful offensive to retake Kherson last year. “Nothing happens for several months and then suddenly the results come in. Because once they’ve degraded some sectors sufficiently to attempt a breakthrough, if the breakthrough works, you will see it very quickly afterwards,” he added. Slantchev, however, said the delay behind key weapons and armor shipments has been an issue for Ukraine. He argued F-16s and ATACMS are not “wonder weapons” but more advanced weapons can be considered “game changers.” He also said Kyiv has only received some of the equipment promised earlier this year. “A lot of the promises that we’ve made are longer term, that will take months,” he said. “It’s not that they’re lying. It’s just that the people who say we’ve given a lot make it sound like everything that’s been promised is actually delivered, or will be delivered shortly, which is just not true.” Pentagon spokesperson Brig. Gen. Pat Ryder on Thursday characterized the current phase of the war as a “tough fight” but praised the Ukrainian army for its past victories and ability to overcome great odds. “We’ve known from the beginning that regardless of when any counteroffensive started, it was going to be a tough fight,” Ryder told reporters. “Going forward, we’re going to continue to consult with them, we’re going to continue to provide them training so that they can take back sovereign territory.” The White House doubled down on that commitment on Thursday, requesting another $13 billion in security aid for Ukraine from Congress. The Biden administration has also played down a CNN poll last week that found most Americans don’t want Congress to authorize additional aid to Ukraine. The counteroffensive so far has achieved the liberation of around 100 square miles of territory within two months, compared to the thousands of square miles retaken in the Kherson and Kharkiv offenses last year. Part of the problem for Ukraine is the extensive network of defenses Russia had months to construct and continues to fortify. Ukrainian Deputy Defense Minister Hanna Maliar this week admitted Russia was “seriously strengthening its defensive lines.” “And our troops are now faced not only with mining, but also with concrete engineering fortification of key commanding heights,” she said in a But Ukraine is adjusting its tactics and still maintains the initiative, said Mick Ryan, a retired major general from the Australian Army and a military analyst. Ukrainian forces are now seizing small bits of territory, holding the land and moving forward under the cover of artillery. “Ukraine is making some progress. Because none of us, except the Ukrainian military high command and government members, know the actual Ukrainian objectives for each phase of the war, we cannot say with any certainty whether this is behind or on schedule,” he wrote in a . “However, Ukraine is recovering its territory.” One of the most difficult challenges for Ukraine outside of the battlefield is countering expectations in the West for immediate results. In recent speeches, Ukrainian President Volodymyr Zelensky has repeatedly called for “maximum focus” and unity behind Ukraine and its allies during the offensive. Mykhailo Podolyak, adviser to the office of Zelensky, that it can take on Russia and supporters should not get carried away by relentlessly commenting on the speed of the operation. “Everyone needs to be patient and closely monitor the high-quality work of the Armed Forces of Ukraine,” he said.",
      "pubDate": "2023-08-10 21:55:38",
      "image_url": "https://thehill.com/wp-content/uploads/sites/2/2023/08/ukraine_080923_via-ap_ukraine.jpg?w=900",
      "source_id": "thehill",
      "category": ["top"],
      "country": ["united states of america"],
      "language": "english"
    },
    {
      "title": "White House requests $40 billion for Ukraine, Border Security and FEMA",
      "link": "https://www.wcpo.com/white-house-requests-40-billion-for-ukraine-border-security-and-fema",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "The request includes $12 billion to supplement FEMA, whose Disaster Relief Fund is expected to run out of cash sometime this month.",
      "content": "The White House is asking Congress to open its checkbook again, requesting $40 billion to aid the war in Ukraine, beef up border security and fund federal assistance for natural disasters. The new supplemental funding request, unveiled Thursday, includes $24 billion in security, economic and humanitarian aid to Ukraine, $4 billion for border security and migration and $12 billion for the Federal Emergency Management Agency as extreme weather continues to plague much of the U.S. It also includes a request for $60 million to support pay raises for wildland firefighters. The White House said previous aid packages for Ukraine \"have been committed or nearly committed.\" The request includes funding for not only Ukraine’s defense, but also to leverage greater financing for developing countries impacted by Russia's invasion and $200 million to strengthen countries in Africa against Wagner, a mercenary group that has fought against Ukraine and in African countries. \"As the impacts of Russia’s war reverberate around the globe, the United States is committed to maintaining strong global opposition to Russia’s illegal war. At the same time, it is essential that we offer a credible alternative to the PRC's coercive and unsustainable lending and infrastructure projects for developing countries around the world,\" the letter from Office of Management and Budget Director Shalanda Young to House Speaker Kevin McCarthy states. More than a year after the war in Ukraine began, some polls show Americans are becoming more hesitant to send additional aid to the country. Though most surveys show Americans' support for Ukraine remains high, Americans are growing less supportive of sending more money to Kiev. A recent CNN poll found 55% of Americans said Congress should not authorize more funding for Ukraine. Speaking to reporters on a phone call on Wednesday, White House National Security Spokesman John Kirby said continued aid for Ukraine is important for national security. \"I think it’s important to remember that if we just sit back and we let Putin win, we let him take Ukraine, where does it stop next?\" He said. Senate Majority Leader Chuck Schumer, D-New York, a key proponent of Ukraine aid on Capitol Hill, was quick to praise the additional proposed aid Thursday, saying in a statement the Administration's request \"should send a clear signal to Vladimir Putin.\" Reached for comment, Senate Minority Leader Mitch McConnell, another key proponent of Ukraine aid, declined to outright endorse the supplemental, telling Scripps News he planned to \"carefully [review] the Administration's request to make sure it is necessary and appropriate to keep America safe, secure our borders, support our allies, and help communities rebuild after disasters.\" Meanwhile, a spokesperson for House Speaker Kevin McCarthy said, \"A Republican-led House will not rubber-stamp any blank-check funding requests; rather, the Administration’s emergency funding requests must be reviewed and scrutinized on their merits consistent with the practice and principles of our majority.\" The Biden administration has been adamant it would continue support for Ukraine for as long as it’s needed. The United States has committed more than $43 billion to Ukraine since the invasion started, according to the Department of Defense. It has also led a coalition of dozens of countries coordinating military support. \"The fact of the matter is that I believe we'll have the funding necessary to support Ukraine as long as it takes. And I believe that we’re going to, that that support will be real, even though there are, you hear some voices today on Capitol Hill about whether or not we should continue to support Ukraine and for how long we should support them,\" President Biden said in June. SEE MORE: US hit by a record number of billion-dollar disasters so far this year FEMA's Disaster Relief Fund is expected to run out of money by the end of the month, according to the agency's most recent monthly report . President Biden tasked the agency Thursday with responding to the wildfires that struck Hawaii this week . Catastrophic weather and climate events caused more than $170 billion in damages last year alone, according to data from NOAA. \"Due to ongoing recovery needs in every state [FEMA] projects a significant deficit in the Disaster Relief Fund,\" the letter states. The White House's funding request comes as lawmakers are currently on August recess. Congress is not expected to fully return to Washington until mid-September. Sen. Susan Collins, the Vice Chair of the Senate Appropriations committee, told Scripps News she wanted \"to see a supplemental as soon as possible\" just one day before the August Recess began. \"It is absurd. It is clearly needed. I mean, when you look at the horrendous flooding in states as diverse as Kentucky, in Vermont, it is evident that the Disaster Relief Fund (DRF) will need to be replenished,\" Collins told Scripps News. \"We have heard nothing,” echoed Sen. Katie Britt, the lead Republican on the Senate's Appropriations Subcommittee on Homeland Security, which approves funding for FEMA, last month, before leaving for August recess. Lawmakers knew back in January that the agency would soon need additional funding for disasters. At the time, the estimate was around $11.7 billion. In April, testifying before the House Appropriations committee, FEMA Administrator Criswell told members of Congress the projected shortfall would come in July, as localities were finalizing their COVID-19 disaster bills and submitting them to the federal government for reimbursement, ahead of the pandemic emergency response expiring in May. Supplemental requests for disaster relief have become routine. Between 1992 and 2021, nearly three-quarters of the Disaster Relief Fund budget was provided through supplemental appropriations, according to the Congressional Budget Office. Hurricane recovery made up the bulk of the need. The request also includes support for resources at the border following the implementation of Biden's border plan with the end of Title 42. It includes more than $2 billion for border management, shelter and services for migrants and $416 million to help combat fentanyl. \"We are operating within a fundamentally broken immigration system — everyone agrees on that point — but only Congress has the power to update our immigration and asylum laws, and we continue to stand ready to work with Congress on solutions,\" the OMB letter states. Nevertheless, the top Democrat on the House Border Security and Enforcement Subcommittee, Rep. Lou Correa, D-Calf., called the supplemental border funding \"good public policy\" in a statement, adding that the funding would \"be crucial, and will be used to ensure that those on our nation's frontlines have the resources they need to keep our border safe, secure, and humane—all while keeping legitimate trade, commerce, goods and services flowing, and protecting our communities from illicit drugs and human traffickers.\" The request comes after President Biden and Speaker McCarthy reached an agreement to raise the debt limit and avoid default last spring, which included spending caps. Administration officials believe that agreement doesn't preclude emergency legislation such as this request. SEE MORE: Strikes kill 7 in Ukraine as Kyiv accuses Moscow of targeting rescuers Trending stories at Scrippsnews.com",
      "pubDate": "2023-08-10 21:45:44",
      "image_url": null,
      "source_id": "wcpo",
      "category": ["top"],
      "country": ["united states of america"],
      "language": "english"
    },
    {
      "title": "White House requests $40 billion for Ukraine, Border Security and FEMA",
      "link": "https://www.tmj4.com/white-house-requests-40-billion-for-ukraine-border-security-and-fema",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "The request includes $12 billion to supplement FEMA, whose Disaster Relief Fund is expected to run out of cash sometime this month.",
      "content": "The White House is asking Congress to open its checkbook again, requesting $40 billion to aid the war in Ukraine, beef up border security and fund federal assistance for natural disasters. The new supplemental funding request, unveiled Thursday, includes $24 billion in security, economic and humanitarian aid to Ukraine, $4 billion for border security and migration and $12 billion for the Federal Emergency Management Agency as extreme weather continues to plague much of the U.S. It also includes a request for $60 million to support pay raises for wildland firefighters. The White House said previous aid packages for Ukraine \"have been committed or nearly committed.\" The request includes funding for not only Ukraine’s defense, but also to leverage greater financing for developing countries impacted by Russia's invasion and $200 million to strengthen countries in Africa against Wagner, a mercenary group that has fought against Ukraine and in African countries. \"As the impacts of Russia’s war reverberate around the globe, the United States is committed to maintaining strong global opposition to Russia’s illegal war. At the same time, it is essential that we offer a credible alternative to the PRC's coercive and unsustainable lending and infrastructure projects for developing countries around the world,\" the letter from Office of Management and Budget Director Shalanda Young to House Speaker Kevin McCarthy states. More than a year after the war in Ukraine began, some polls show Americans are becoming more hesitant to send additional aid to the country. Though most surveys show Americans' support for Ukraine remains high, Americans are growing less supportive of sending more money to Kiev. A recent CNN poll found 55% of Americans said Congress should not authorize more funding for Ukraine. Speaking to reporters on a phone call on Wednesday, White House National Security Spokesman John Kirby said continued aid for Ukraine is important for national security. \"I think it’s important to remember that if we just sit back and we let Putin win, we let him take Ukraine, where does it stop next?\" He said. Senate Majority Leader Chuck Schumer, D-New York, a key proponent of Ukraine aid on Capitol Hill, was quick to praise the additional proposed aid Thursday, saying in a statement the Administration's request \"should send a clear signal to Vladimir Putin.\" Reached for comment, Senate Minority Leader Mitch McConnell, another key proponent of Ukraine aid, declined to outright endorse the supplemental, telling Scripps News he planned to \"carefully [review] the Administration's request to make sure it is necessary and appropriate to keep America safe, secure our borders, support our allies, and help communities rebuild after disasters.\" Meanwhile, a spokesperson for House Speaker Kevin McCarthy said, \"A Republican-led House will not rubber-stamp any blank-check funding requests; rather, the Administration’s emergency funding requests must be reviewed and scrutinized on their merits consistent with the practice and principles of our majority.\" The Biden administration has been adamant it would continue support for Ukraine for as long as it’s needed. The United States has committed more than $43 billion to Ukraine since the invasion started, according to the Department of Defense. It has also led a coalition of dozens of countries coordinating military support. \"The fact of the matter is that I believe we'll have the funding necessary to support Ukraine as long as it takes. And I believe that we’re going to, that that support will be real, even though there are, you hear some voices today on Capitol Hill about whether or not we should continue to support Ukraine and for how long we should support them,\" President Biden said in June. FEMA's Disaster Relief Fund is expected to run out of money by the end of the month, according to the agency's . President Biden tasked the agency Thursday with responding to the . Catastrophic weather and climate events caused more than $170 billion in damages last year alone, according to data from NOAA. \"Due to ongoing recovery needs in every state [FEMA] projects a significant deficit in the Disaster Relief Fund,\" the letter states. The White House's funding request comes as lawmakers are currently on August recess. Congress is not expected to fully return to Washington until mid-September. Sen. Susan Collins, the Vice Chair of the Senate Appropriations committee, told Scripps News she wanted \"to see a supplemental as soon as possible\" just one day before the August Recess began. \"It is absurd. It is clearly needed. I mean, when you look at the horrendous flooding in states as diverse as Kentucky, in Vermont, it is evident that the Disaster Relief Fund (DRF) will need to be replenished,\" Collins told Scripps News. \"We have heard nothing,” echoed Sen. Katie Britt, the lead Republican on the Senate's Appropriations Subcommittee on Homeland Security, which approves funding for FEMA, last month, before leaving for August recess. Lawmakers knew back in January that the agency would soon need additional funding for disasters. At the time, the estimate was around $11.7 billion. In April, testifying before the House Appropriations committee, FEMA Administrator Criswell told members of Congress the projected shortfall would come in July, as localities were finalizing their COVID-19 disaster bills and submitting them to the federal government for reimbursement, ahead of the pandemic emergency response expiring in May. Supplemental requests for disaster relief have become routine. Between 1992 and 2021, nearly three-quarters of the Disaster Relief Fund budget was provided through supplemental appropriations, according to the Congressional Budget Office. Hurricane recovery made up the bulk of the need. The request also includes support for resources at the border following the implementation of Biden's border plan with the end of Title 42. It includes more than $2 billion for border management, shelter and services for migrants and $416 million to help combat fentanyl. \"We are operating within a fundamentally broken immigration system — everyone agrees on that point — but only Congress has the power to update our immigration and asylum laws, and we continue to stand ready to work with Congress on solutions,\" the OMB letter states. Nevertheless, the top Democrat on the House Border Security and Enforcement Subcommittee, Rep. Lou Correa, D-Calf., called the supplemental border funding \"good public policy\" in a statement, adding that the funding would \"be crucial, and will be used to ensure that those on our nation's frontlines have the resources they need to keep our border safe, secure, and humane—all while keeping legitimate trade, commerce, goods and services flowing, and protecting our communities from illicit drugs and human traffickers.\" The request comes after President Biden and Speaker McCarthy reached an agreement to raise the debt limit and avoid default last spring, which included spending caps. Administration officials believe that agreement doesn't preclude emergency legislation such as this request.",
      "pubDate": "2023-08-10 21:45:44",
      "image_url": null,
      "source_id": "tmj4",
      "category": ["top"],
      "country": ["united states of america"],
      "language": "english"
    },
    {
      "title": "Ukraine orders evacuation of parts of north-east",
      "link": "https://www.fbcnews.com.fj/world/ukraine-orders-evacuation-of-parts-of-north-east/",
      "keywords": ["World"],
      "creator": ["Julia Vadei"],
      "video_url": null,
      "description": "Ukraine has ordered the mandatory evacuation of all civilians from 37 settlements in the northeast as Russia steps up its attacks there. The authorities in the Kupiansk district of the Kharkiv region said they had to act because of “constant Russian shelling” in the area. A woman was killed by shelling in the district on […]",
      "content": "Ukraine has ordered the mandatory evacuation of all civilians from 37 settlements in the northeast as Russia steps up its attacks there. The authorities in the Kupiansk district of the Kharkiv region said they had to act because of “constant Russian shelling” in the area. A woman was killed by shelling in the district on Thursday, Ukraine said. Russia says its troops have gained some ground in the area. Ukraine says Russian attacks have been rebuffed. The comments by the two warring sides have not been independently verified. In a statement, the Kupiansk district authorities said residents of two towns and 35 villages were being evacuated. They said that civilians were being evacuated to “safe regions” of Ukraine. A resident in Kivsharivka – one of the villages being evacuated – said she was preparing to leave with her children, while her husband wanted to stay to care for his elderly mother. In its latest briefing, the Russian defence ministry said its assault units in the Kupiansk direction had “improved their position along the front line during offensive operations”. Ukraine’s military said its forces “successfully repelled” Russian attacks. But on Thursday evening a woman was killed and a man was injured when a Russian shell hit a house in the village of Podoly, Kupiansk district, Ukrainian officials said. The evacuation order is not the first for Kupiansk residents. In March, children and people “with limited mobility” were ordered to evacuate from Kupiansk city because of an increase in Russian shelling. Kupiansk – an important transport and logistics regional hub – has witnessed fierce fighting since Russian President Vladimir Putin ordered a full-scale invasion of Ukraine on 24 February 2022. Russian troops seized the city in a matter of days – but Ukrainian forces took back control during a rapid counter-attack last September. Those advances – and the liberation of Ukraine’s southern city of Kherson – were the most significant front-line changes since Russia withdrew from areas around the capital Kyiv in April. Also on Thursday, one person was killed in a Russian attack on a “civilian infrastructure” in Ukraine’s southern Zaporizhzhia city, local officials said. They said another nine people were injured.",
      "pubDate": "2023-08-10 21:30:54",
      "image_url": null,
      "source_id": "fbcnews",
      "category": ["top"],
      "country": ["Fiji"],
      "language": "english"
    },
    {
      "title": "Biden asks Congress for $40 billion to support Ukraine, replenish US disaster aid and bolster border",
      "link": "https://www.dailypress.com/2023/08/10/biden-asks-congress-for-more-than-13b-to-support-ukraine-and-12b-for-disaster-fund/",
      "keywords": ["National News", "News", "network"],
      "creator": ["Associated Press"],
      "video_url": null,
      "description": "The requested package also includes $12 billion to replenish the U.S. federal disaster funds at home after a deadly climate season of heat and storms, and funds to bolster enforcement at the Southern border with Mexico.",
      "content": "By LISA MASCARO and COLLEEN LONG (Associated Press) WASHINGTON (AP) — The Biden administration on Thursday asked Congress to provide more than $13 billion in emergency defense aid to Ukraine and an additional $8 billion for humanitarian support through the end of the year, another massive infusion of cash as the Russian invasion wears on and Ukraine pushes a counteroffensive against the Kremlin’s deeply entrenched forces. The package includes $12 billion to replenish the U.S. federal disaster funds at home after a deadly climate season of heat and storms, and funds to bolster the enforcement at the Southern border with Mexico, including money to curb the flow of deadly fentanyl. All told, it’s a $40 billion package. While the last such request from the White House for Ukraine funding was easily approved in 2022, there’s a different dynamic this time. A political divide on the issue has grown, with the Republican-led House facing enormous pressure to demonstrate support for the party’s leader, Donald Trump, who has been very skeptical of the war. And American support for the effort has been slowly softening. White House budget director Shalanda Young, in a letter to House Speaker Kevin McCarthy, urged swift action to follow through on the U.S. “commitment to the Ukrainian peoples’ defense of their homeland and to democracy around the world” as well as other needs. The request was crafted with an eye to picking up support from Republicans, as well as Democrats, particularly with increased domestic funding around border issues — a top priority for the GOP, which has been highly critical of the Biden administration’s approach to halting the flow of migrants crossing from Mexico. Still, the price tag of $40 billion may be too much for Republicans who are fighting to slash, not raise, federal outlays. As a supplemental request, the package the White House is sending to Congress falls outside the budget caps both parties agreed to as part of the debt ceiling showdown earlier this year. Senate Majority Leader Chuck Schumer, D-N.Y., said in a statement there was strong bipartisan support in the U.S. Senate. “The latest request from the Biden administration shows America’s continued commitment to helping Americans here at home and our friends abroad,” he said. “We hope to join with our Republican colleagues this fall to avert an unnecessary government shutdown and fund this critical emergency supplemental request.” President Joe Biden and his senior national security team have repeatedly said the United States will help Ukraine “as long as it takes” to oust Russia from its borders. Privately, administration officials have warned Ukrainian officials that there is a limit to the patience of a narrowly divided Congress — and American public — for the costs of a war with no clear end. “For people who might be concerned the costs are getting too high, we’d ask them what the costs — not just in treasure but in blood, perhaps even American blood — could be if Putin subjugates Ukraine,” White House national security spokesman John Kirby said this week. Support among the American public for providing Ukraine weaponry and direct economic assistance has softened with time. An AP-NORC poll conducted in January 2023 around the one-year mark of the conflict, found that 48% favored the U.S. providing weapons to Ukraine, down from the 60% of U.S. adults who were in favor sending Ukraine weapons in May 2022. While Democrats have generally been more supportive than Republicans of offering weaponry, their support dropped slightly from 71% to 63% in the same period. Republicans’ support dropped more, from 53% to 39%. Dozens of Republicans in the House and some GOP senators have expressed reservations, and even voted against, spending more federal dollars for the war effort. Many of those Republicans are aligning with Trump’s objections to the U.S. involvement overseas. That means any final vote on Ukraine aid will likely need to rely on a hefty coalition led by Democrats from Biden’s party to ensure approval. The funding includes another $10 billion to counter Russian and Chinese influence elsewhere by bolstering the World Bank and providing aid to resist Russian-aligned Wagner forces in Africa. Domestically, there’s an additional $60 million to address increased wildfires that have erupted nationwide. And the request includes $2.2 billion for Southern border management and $766 million to curb the flow of deadly fentanyl. There is also $100 million earmarked for the Department of Labor to ramp up investigations of suspected child labor violations. To ease passage, Congress would likely try to attach the package to a must-pass measure for broader government funding in the U.S. that’s needed by Oct. 1 to prevent any shutdown in federal offices. Members of Congress have repeatedly pressed Defense Department leaders on how closely the U.S. is tracking its aid to Ukraine to ensure that it is not subject to fraud or ending up in the wrong hands. The Pentagon has said it has a “robust program” to track the aid as it crosses the border into Ukraine and to keep tabs on it once it is there, depending on the sensitivity of each weapons system. Ukraine is pushing through with its ongoing counteroffensive, in an effort to dislodge the Kremlin’s forces from territory they’ve occupied since a full-scale invasion in February 2022. The counteroffensive has come up against heavily mined terrain and reinforced defensive fortifications. The U.S. has approved four rounds of aid to Ukraine in response to Russia’s invasion, totaling about $113 billion, with some of that money going toward replenishment of U.S. military equipment that was sent to the frontlines. Congress approved the latest round of aid in December, totaling roughly $45 billion for Ukraine and NATO allies. While the package was designed to last through the end of the fiscal year in September, much depends upon events on the ground. “We remain confident that we’ll be able to continue to support Ukraine for as long as it takes,” said Pentagon press secretary Brig. Gen. Pat Ryder. There were questions in November about waning Republican support to approve the package, but it ultimately passed. Now, though, House Speaker McCarthy is facing pressure to impeach Biden over unproven claims of financial misconduct and it’s not clear whether a quick show of support for Ukraine could cause political damage in what’s expected to be a bruising 2024 reelection campaign. Trump contends that American involvement has only drawn Russia closer to other adversarial states like China, and has condemned the tens of billions of dollars that the United States has provided in aid for Ukraine. ___ Long reported from Chicago. Sign up for email newsletters",
      "pubDate": "2023-08-10 21:29:15",
      "image_url": "https://www.dailypress.com/wp-content/uploads/2023/08/AP23221863397492.jpg?w=1400px&strip=all",
      "source_id": "dailypress",
      "category": ["top"],
      "country": ["united states of america"],
      "language": "english"
    },
    {
      "title": "Biden Asks Congress For $13 Billion In New Ukraine Military Aid",
      "link": "https://www.ndtv.com/world-news/joe-biden-asks-congress-for-13-billion-in-new-ukraine-military-aid-4288253",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "President Joe Biden's administration on Thursday asked Congress for more than $13 billion in new military spending for Ukraine, citing the need for continued support following Russia's \"unprovoked\" invasion of the country last year.",
      "content": "Joe Biden's administration asked Congress for more than $13 billion in new military aid for Ukraine. President Joe Biden's administration on Thursday asked Congress for more than $13 billion in new military spending for Ukraine, citing the need for continued support following Russia's \"unprovoked\" invasion of the country last year. Promoted Listen to the latest songs, only on JioSaavn.com The funding would support Ukraine and other vulnerable countries \"impacted by Russia's unprovoked and brutal invasion,\" Office of Management and Budget director Shalanda Young wrote in a letter to Congressional leader Kevin McCarthy and others. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
      "pubDate": "2023-08-10 20:57:53",
      "image_url": null,
      "source_id": "ndtv",
      "category": ["world"],
      "country": ["india"],
      "language": "english"
    },
    {
      "title": "Ukraine funding request sets up battle when Congress returns",
      "link": "https://thehill.com/business/appropriations/4147794-ukraine-funding-request-sets-up-battle-when-congress-returns/",
      "keywords": ["Appropriations", "Business", "Defense", "Policy"],
      "creator": ["Aris Folley", "Brad Dress"],
      "video_url": null,
      "description": "The White House’s latest request for additional funding for Ukraine is likely to add fuel to the already contentious spending debate when Congress returns in September. The White House on Thursday asked Congress for $13.1 billion in supplemental funding for the Department of Defense in response to the war in Ukraine. That includes funding for...",
      "content": "The White House’s latest request for additional funding for Ukraine is likely to add fuel to the already contentious spending debate when Congress returns in September. The White House on Thursday asked Congress for $13.1 billion in supplemental funding for the Department of Defense in response to the war in Ukraine. That includes funding for equipment, military and intelligence support. The White House additionally requested $8.5 billion in funding for the State Department and the United States Agency for International Development, which includes $7.3 billion in “economic, humanitarian, and security assistance” for Ukraine and other impacted countries. The White House is seeking the dollars to be greenlit as part of a potential short-term funding bill, also known as a continuing resolution (CR), that many lawmakers expect Congress needs to pass by the end of September to prevent a government shutdown. “I think there’s a very good chance that we’ll see a CR, but I know there’s a lot of work to get a CR done,” Rep. Robert Aderholt (R-Ala.), who serves on the House Appropriations Committee, recently told The Hill, noting there are “a lot of members who don’t want CRs that are tired of them.” The Ukraine funding is likely to add a complication. Some conservatives have expressed opposition to any short-term bill that keeps funding at fiscal 2023 levels, and some have also opposed sending additional money to Ukraine. In a narrowly divided House, their opposition could be enough to sink any partisan spending bill. The request could also widen the rift between the House and Senate, which are already crafting bills at different spending levels after hard-line conservatives in the House pushed back on a deal struck between President Biden and Speaker Kevin McCarthy (R-Calif.). Senate Minority Leader Mitch McConnell (R-Ky.) has for defense spending were too low, while McCarthy signaled earlier this year that further funding for Ukraine would need to come through the annual appropriations process as opposed to a separate funding bill. “The question to me is … why would you do a supplemental? We just passed an agreement. You work through the [appropriations process]. They’re trying to go around the agreement,” McCarthy said in June. “If anyone thinks at the end of the day, ‘Ukraine needs money,’ you’re gonna have to show: What did we spend our money on? What is the plan for victory? And what do you need the money for? You don’t just go say, ‘Oh, go vote for some supplemental,’” he added. In a letter to McCarthy last month, a group of 21 conservatives called on the Speaker to “publicly reject” the possibility of a supplemental Ukraine appropriations bill, while also pressing for GOP negotiators to mark up overall funding bills at far lower levels than the caps agreed upon between Biden and McCarthy. At the same time, Senate Appropriations Chairwoman Patty Murray (D-Wash.) last month announced a deal struck with Republicans to add $13.7 billion in additional emergency funding on top of their appropriations bills. The proposal included $8 billion for defense programs and $5.7 billion for nondefense programs. Senate appropriators on both sides of the aisle defended the move, with Sen. Lindsey Graham (R-S.C.) citing Russia’s ongoing war against Ukraine. “It’s really an emergency, what Russia is doing, and Ukraine, with grain production,” Graham said then. “Wait until it hits the developing world. About half the developing world gives their grain needs from Ukraine.” “There is a tsunami of problems flowing from the lack of food and this war caused by Russia and the money in this bill helps some,” he said at an appropriations hearing last month. “And it will encourage other countries to do more.” The roughly $47 billion in direct security aid for Ukraine approved by Congress last year . The latest packages in June and July have inched closer and closer to the end of the pile of approved money, even as Ukraine’s war with Russia continues in full force. Ukrainian forces are in the midst of one of the hardest battles in the war yet, struggling to overcome entrenched Russian lines in the southeastern Zaporizhzhia region. The slow pace of Ukraine’s counteroffensive might add to the tensions expected to play out on the House floor from more conservative lawmakers who are opposed to funding Ukraine’s military needs. But House Republicans have maintained there is still strong support for Ukraine in the lower chamber. Republican leaders in the House Armed Services and House Foreign Affairs committees have also called for more advanced weapons to Ukraine, including Army Tactical Missile System and F-16 fighter jets. aimed at reining in U.S. involvement in the war through an annual defense policy bill also failed after a majority of the conference voted against the initiatives. Still, public support for Ukraine has dropped since last year, with a CNN poll last week that found of sending more aid to Ukraine. Republicans in the poll were less supportive of sending more aid to Ukraine than Democrats, with 71 percent in the GOP against and 38 percent of Democrats who said the same.",
      "pubDate": "2023-08-10 20:55:52",
      "image_url": "https://thehill.com/wp-content/uploads/sites/2/2023/07/International-Odesa_072323_AP_Jae-C.-Hong.jpg?w=900",
      "source_id": "thehill",
      "category": ["top"],
      "country": ["united states of america"],
      "language": "english"
    },
    {
      "title": "Biden's $40 billion emergency spending request gives $13 billion more in military aid to Ukraine",
      "link": "https://www.washingtontimes.com/news/2023/aug/10/bidens-40-billion-emergency-spending-request-gives/?utm_source=RSS_Feed&utm_medium=RSS",
      "keywords": null,
      "creator": ["Dave Boyer"],
      "video_url": null,
      "description": "President Biden asked Congress Thursday for $40 billion in emergency spending through the end of this year, including $24 billion more for Ukraine -- funding that would sidestep recently enacted budget caps and set up a clash with Republicans over more aid for Kyiv's war against Russia.",
      "content": "Back Print By Dave Boyer - The Washington Times - Thursday, August 10, 2023 President Biden asked Congress Thursday for $40 billion in emergency spending through the end of this year, including $24 billion more for Ukraine — funding that would sidestep recently enacted budget caps and set up a clash with Republicans over more aid for Kyiv’s war against Russia. The proposed Ukraine aid includes $13.1 billion for military assistance and replenishing Defense Department stockpiles depleted by the war effort. There is also $200 million to counter the “destabilizing” impact of the Wagner Group, whose thousands of mercenaries have been a key part of Russia’s ground war. The president’s request seeks another $4 billion for enforcement at America’s southern border — although administration officials say Mr. Biden’s plan for the border is working — and $12 billion for disaster relief, including extended pay for firefighters battling wildfires. The extra funding for Ukraine follows roughly $100 billion that the U.S. already has spent on the war in Eastern Europe. And it comes as polls show support eroding among Americans for the growing overseas commitment of taxpayer dollars. “The administration is requesting supplemental security, economic and humanitarian assistance funding that would support Ukraine as well as countries and vulnerable populations worldwide impacted by Russia’s unprovoked and brutal invasion of Ukraine,” White House Office of Management and Budget Director Shalanda D. Young told House Speaker Kevin McCarthy in a letter on Thursday. Many conservative House Republicans are resisting more funding for Ukraine without stricter oversight. Mr. McCarthy has said he would not allow a vote on more aid to Ukraine if the action bypasses the $886 billion defense-spending cap set in May in the debt-limit agreement with Mr. Biden, a deal that caused a temporary rebellion by some GOP lawmakers against the speaker. The speaker’s office didn’t reply to a request for comment. Some House Republicans said Thursday they are opposed to more aid for Ukraine. “Americans are struggling under ‘Bidenomics,’ watching a border invasion bring crime … and witnessing a corrupt two-tiered justice system, and this president wants billions more for Ukraine. Put Americans first,” Rep. Bob Good, Virginia Republican, said in a statement online. “I stand with the majority of Americans who reject funneling more unaccounted-for funds to Ukraine. It’s time for Washington to put America first.” Rep. Lauren Boebert, Colorado Republican, said online, “It’s amazing how the federal government will always find money for other nations even as we sit at $30 TRILLION in debt.” Former President Donald Trump has urged congressional Republicans to withhold more military support for Ukraine until the administration cooperates with GOP investigations of the president and his son Hunter Biden’s business dealings. Mr. Trump is the leading candidate for the 2024 GOP presidential nomination. “Congress should refuse to authorize a single additional shipment of our depleted weapons stockpiles … to Ukraine until the FBI, DOJ and IRS hand over every scrap of evidence they have on the Biden crime family’s corrupt business dealings,” Mr. Trump said at a rally in Pennsylvania. He said Republicans who don’t support his suggestion should face primary challenges. Congress approved $45 billion in extra funding for Ukraine in December, an aid package that was meant to last until the current fiscal year ends on Sept. 30. Ukrainian forces have made slow progress in a counteroffensive against Russian troops, and the U.S. and European allies have pledged more help. A majority of Americans, 55%, say Congress should not authorize additional funding to support Ukraine, according to a CNN poll last week. The survey found 45% of respondents supported more U.S. funding for Ukraine. The issue is likely to come to a head in September as Congress considers a stopgap spending measure to keep the government open beyond Sept. 30. To help ease passage, the administration is submitting the request as part of a short-term funding proposal to prevent a partial government shutdown. The White House said the extra money for the border is needed for “border enforcement management and migrant services at the Department of Homeland Security, and to hire immigration judge teams at the Department of Justice.” Of the $4 billion, $800 million would be directed to efforts to curb the flow of illicit fentanyl into the U.S. “Despite the fundamentally broken system, unlawful border crossings are down significantly since the president implemented his border enforcement and management plan after the end of Title 42,” the letter stated. “The administration has achieved this in a safe, orderly and humane manner, in part by pairing increased access to legal pathways with new consequences for those who fail to use them.” Title 42 was a measure that allowed the government to expel illegal migrants for health considerations during the COVID-19 pandemic. Mr. Biden said his administration’s border plan in the wake of the expiration of Title 42 is “working as intended,” but the extra money is needed to “bolster” those efforts. Aid for natural disasters takes up a considerable chunk, $12 billion, of the president’s request. Ms. Young said the money will ensure that the Federal Emergency Management Agency “can continue to support critical activities in communities that have dealt with or are currently dealing with disasters while also maintaining sufficient preparedness to respond to future catastrophic events — preparedness that will be especially important as we enter peak hurricane season.” Senior administration officials said they want an extra $60 million to bolster the pay of wildland firefighters for three months. The administration blamed “increased wildfires due to climate crisis.” • Dave Boyer can be reached at dboyer@washingtontimes.com . Copyright © 2023 The Washington Times, LLC. Click here for reprint permission . Please read our comment policy before commenting. Click to Read More and View Comments Click to Hide",
      "pubDate": "2023-08-10 20:45:06",
      "image_url": "https://twt-thumbs.washtimes.com/media/image/2023/08/10/Biden_70720--478eb_s1440x960.jpg?f72536d07237fdd262042ae8f5e6e6de3b865f3c",
      "source_id": "washingtontimes",
      "category": ["top"],
      "country": ["united states of america"],
      "language": "english"
    }
  ],
  "nextPage": "1691700306b404a2356c5db1787c96ae5c40cd17b0"
}
